/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf_flags.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kshim <kshim@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/19 16:25:48 by kshim             #+#    #+#             */
/*   Updated: 2022/04/19 16:27:46 by kshim            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int check_flags(char *arg, t_fp_node_lst *new_node_lst)
{
	/* check에 해당하는 flag를 리스트에 입력.
	 * 조건 오류일 경우 특수한 수치 <-1> 반환*/
	return (0);
}
